zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXE247VLQ-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXE247VLQ/signal_configuration.xml
 *
 * Copyright 2025 NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXE247VLQ_
#define _ZEPHYR_DTS_BINDING_MCXE247VLQ_

#define KINETIS_MUX(port, pin, mux)		\
	(((((port) - 'A') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0x7) << 8))

#define CMP0_IN0_PTA0 KINETIS_MUX('A',0,0) /* PTA_0 */
#define ADC0_SE0_PTA0 KINETIS_MUX('A',0,0) /* PTA_0 */
#define PTA0 KINETIS_MUX('A',0,1) /* PTA_0 */
#define FTM2_CH1_PTA0 KINETIS_MUX('A',0,2) /* PTA_0 */
#define LPI2C0_SCLS_PTA0 KINETIS_MUX('A',0,3) /* PTA_0 */
#define FXIO_D2_PTA0 KINETIS_MUX('A',0,4) /* PTA_0 */
#define FTM2_QD_PHA_PTA0 KINETIS_MUX('A',0,5) /* PTA_0 */
#define LPUART0_CTS_PTA0 KINETIS_MUX('A',0,6) /* PTA_0 */
#define TRGMUX_OUT3_PTA0 KINETIS_MUX('A',0,7) /* PTA_0 */
#define CMP0_IN1_PTA1 KINETIS_MUX('A',1,0) /* PTA_1 */
#define ADC0_SE1_PTA1 KINETIS_MUX('A',1,0) /* PTA_1 */
#define PTA1 KINETIS_MUX('A',1,1) /* PTA_1 */
#define FTM1_CH1_PTA1 KINETIS_MUX('A',1,2) /* PTA_1 */
#define LPI2C0_SDAS_PTA1 KINETIS_MUX('A',1,3) /* PTA_1 */
#define FXIO_D3_PTA1 KINETIS_MUX('A',1,4) /* PTA_1 */
#define FTM1_QD_PHA_PTA1 KINETIS_MUX('A',1,5) /* PTA_1 */
#define LPUART0_RTS_PTA1 KINETIS_MUX('A',1,6) /* PTA_1 */
#define TRGMUX_OUT0_PTA1 KINETIS_MUX('A',1,7) /* PTA_1 */
#define ADC1_SE0_PTA2 KINETIS_MUX('A',2,0) /* PTA_2 */
#define PTA2 KINETIS_MUX('A',2,1) /* PTA_2 */
#define FTM3_CH0_PTA2 KINETIS_MUX('A',2,2) /* PTA_2 */
#define LPI2C0_SDA_PTA2 KINETIS_MUX('A',2,3) /* PTA_2 */
#define EWM_OUT_b_PTA2 KINETIS_MUX('A',2,4) /* PTA_2 */
#define FXIO_D4_PTA2 KINETIS_MUX('A',2,5) /* PTA_2 */
#define LPUART0_RX_PTA2 KINETIS_MUX('A',2,6) /* PTA_2 */
#define ADC1_SE1_PTA3 KINETIS_MUX('A',3,0) /* PTA_3 */
#define PTA3 KINETIS_MUX('A',3,1) /* PTA_3 */
#define FTM3_CH1_PTA3 KINETIS_MUX('A',3,2) /* PTA_3 */
#define LPI2C0_SCL_PTA3 KINETIS_MUX('A',3,3) /* PTA_3 */
#define EWM_IN_PTA3 KINETIS_MUX('A',3,4) /* PTA_3 */
#define FXIO_D5_PTA3 KINETIS_MUX('A',3,5) /* PTA_3 */
#define LPUART0_TX_PTA3 KINETIS_MUX('A',3,6) /* PTA_3 */
#define PTA4 KINETIS_MUX('A',4,1) /* PTA_4 */
#define CMP0_OUT_PTA4 KINETIS_MUX('A',4,4) /* PTA_4 */
#define EWM_OUT_b_PTA4 KINETIS_MUX('A',4,5) /* PTA_4 */
#define JTAG_TMS_SWD_DIO_PTA4 KINETIS_MUX('A',4,7) /* PTA_4 */
#define PTA5 KINETIS_MUX('A',5,1) /* PTA_5 */
#define TCLK1_PTA5 KINETIS_MUX('A',5,3) /* PTA_5 */
#define RESET_b_PTA5 KINETIS_MUX('A',5,7) /* PTA_5 */
#define ADC0_SE2_PTA6 KINETIS_MUX('A',6,0) /* PTA_6 */
#define PTA6 KINETIS_MUX('A',6,1) /* PTA_6 */
#define FTM0_FLT1_PTA6 KINETIS_MUX('A',6,2) /* PTA_6 */
#define LPSPI1_PCS1_PTA6 KINETIS_MUX('A',6,3) /* PTA_6 */
#define FTM5_CH5_PTA6 KINETIS_MUX('A',6,4) /* PTA_6 */
#define LPUART1_CTS_PTA6 KINETIS_MUX('A',6,6) /* PTA_6 */
#define ADC0_SE3_PTA7 KINETIS_MUX('A',7,0) /* PTA_7 */
#define PTA7 KINETIS_MUX('A',7,1) /* PTA_7 */
#define FTM0_FLT2_PTA7 KINETIS_MUX('A',7,2) /* PTA_7 */
#define FTM5_CH3_PTA7 KINETIS_MUX('A',7,3) /* PTA_7 */
#define RTC_CLKIN_PTA7 KINETIS_MUX('A',7,4) /* PTA_7 */
#define LPUART1_RTS_PTA7 KINETIS_MUX('A',7,6) /* PTA_7 */
#define PTA8 KINETIS_MUX('A',8,1) /* PTA_8 */
#define LPUART2_RX_PTA8 KINETIS_MUX('A',8,2) /* PTA_8 */
#define LPSPI2_SOUT_PTA8 KINETIS_MUX('A',8,3) /* PTA_8 */
#define FXIO_D6_PTA8 KINETIS_MUX('A',8,4) /* PTA_8 */
#define FTM3_FLT3_PTA8 KINETIS_MUX('A',8,5) /* PTA_8 */
#define FTM4_FLT1_PTA8 KINETIS_MUX('A',8,6) /* PTA_8 */
#define PTA9 KINETIS_MUX('A',9,1) /* PTA_9 */
#define LPUART2_TX_PTA9 KINETIS_MUX('A',9,2) /* PTA_9 */
#define LPSPI2_PCS0_PTA9 KINETIS_MUX('A',9,3) /* PTA_9 */
#define FXIO_D7_PTA9 KINETIS_MUX('A',9,4) /* PTA_9 */
#define FTM3_FLT2_PTA9 KINETIS_MUX('A',9,5) /* PTA_9 */
#define FTM1_FLT3_PTA9 KINETIS_MUX('A',9,6) /* PTA_9 */
#define FTM4_FLT0_PTA9 KINETIS_MUX('A',9,7) /* PTA_9 */
#define PTA10 KINETIS_MUX('A',10,1) /* PTA_10 */
#define FTM1_CH4_PTA10 KINETIS_MUX('A',10,2) /* PTA_10 */
#define FXIO_D0_PTA10 KINETIS_MUX('A',10,4) /* PTA_10 */
#define JTAG_TDO_noetm_TRACE_SWO_PTA10 KINETIS_MUX('A',10,7) /* PTA_10 */
#define PTA11 KINETIS_MUX('A',11,1) /* PTA_11 */
#define FTM1_CH5_PTA11 KINETIS_MUX('A',11,2) /* PTA_11 */
#define FXIO_D1_PTA11 KINETIS_MUX('A',11,4) /* PTA_11 */
#define CMP0_RRT_PTA11 KINETIS_MUX('A',11,5) /* PTA_11 */
#define SAI0_SYNC_PTA11 KINETIS_MUX('A',11,6) /* PTA_11 */
#define PTA12 KINETIS_MUX('A',12,1) /* PTA_12 */
#define FTM1_CH6_PTA12 KINETIS_MUX('A',12,2) /* PTA_12 */
#define CAN1_RX_PTA12 KINETIS_MUX('A',12,3) /* PTA_12 */
#define LPI2C1_SDAS_PTA12 KINETIS_MUX('A',12,4) /* PTA_12 */
#define FTM2_QD_PHB_PTA12 KINETIS_MUX('A',12,6) /* PTA_12 */
#define SAI0_BCLK_PTA12 KINETIS_MUX('A',12,7) /* PTA_12 */
#define PTA13 KINETIS_MUX('A',13,1) /* PTA_13 */
#define FTM1_CH7_PTA13 KINETIS_MUX('A',13,2) /* PTA_13 */
#define CAN1_TX_PTA13 KINETIS_MUX('A',13,3) /* PTA_13 */
#define LPI2C1_SCLS_PTA13 KINETIS_MUX('A',13,4) /* PTA_13 */
#define FTM2_QD_PHA_PTA13 KINETIS_MUX('A',13,6) /* PTA_13 */
#define SAI0_D0_PTA13 KINETIS_MUX('A',13,7) /* PTA_13 */
#define PTA14 KINETIS_MUX('A',14,1) /* PTA_14 */
#define FTM0_FLT0_PTA14 KINETIS_MUX('A',14,2) /* PTA_14 */
#define FTM3_FLT1_PTA14 KINETIS_MUX('A',14,3) /* PTA_14 */
#define EWM_IN_PTA14 KINETIS_MUX('A',14,4) /* PTA_14 */
#define FTM1_FLT0_PTA14 KINETIS_MUX('A',14,6) /* PTA_14 */
#define SAI0_D3_PTA14 KINETIS_MUX('A',14,7) /* PTA_14 */
#define ADC1_SE12_PTA15 KINETIS_MUX('A',15,0) /* PTA_15 */
#define PTA15 KINETIS_MUX('A',15,1) /* PTA_15 */
#define FTM1_CH2_PTA15 KINETIS_MUX('A',15,2) /* PTA_15 */
#define LPSPI0_PCS3_PTA15 KINETIS_MUX('A',15,3) /* PTA_15 */
#define LPSPI2_PCS3_PTA15 KINETIS_MUX('A',15,4) /* PTA_15 */
#define FTM7_FLT0_PTA15 KINETIS_MUX('A',15,5) /* PTA_15 */
#define ADC1_SE13_PTA16 KINETIS_MUX('A',16,0) /* PTA_16 */
#define PTA16 KINETIS_MUX('A',16,1) /* PTA_16 */
#define FTM1_CH3_PTA16 KINETIS_MUX('A',16,2) /* PTA_16 */
#define LPSPI1_PCS2_PTA16 KINETIS_MUX('A',16,3) /* PTA_16 */
#define PTA17 KINETIS_MUX('A',17,1) /* PTA_17 */
#define FTM0_CH6_PTA17 KINETIS_MUX('A',17,2) /* PTA_17 */
#define FTM3_FLT0_PTA17 KINETIS_MUX('A',17,3) /* PTA_17 */
#define EWM_OUT_b_PTA17 KINETIS_MUX('A',17,4) /* PTA_17 */
#define FTM5_FLT0_PTA17 KINETIS_MUX('A',17,5) /* PTA_17 */
#define PTA25 KINETIS_MUX('A',25,1) /* PTA_25 */
#define FTM5_CH0_PTA25 KINETIS_MUX('A',25,2) /* PTA_25 */
#define PTA26 KINETIS_MUX('A',26,1) /* PTA_26 */
#define FTM5_CH1_PTA26 KINETIS_MUX('A',26,2) /* PTA_26 */
#define LPSPI1_PCS0_PTA26 KINETIS_MUX('A',26,3) /* PTA_26 */
#define LPSPI0_PCS0_PTA26 KINETIS_MUX('A',26,4) /* PTA_26 */
#define PTA27 KINETIS_MUX('A',27,1) /* PTA_27 */
#define FTM5_CH2_PTA27 KINETIS_MUX('A',27,2) /* PTA_27 */
#define LPSPI1_SOUT_PTA27 KINETIS_MUX('A',27,3) /* PTA_27 */
#define LPUART0_TX_PTA27 KINETIS_MUX('A',27,4) /* PTA_27 */
#define CAN0_TX_PTA27 KINETIS_MUX('A',27,5) /* PTA_27 */
#define PTA28 KINETIS_MUX('A',28,1) /* PTA_28 */
#define FTM5_CH3_PTA28 KINETIS_MUX('A',28,2) /* PTA_28 */
#define LPSPI1_SCK_PTA28 KINETIS_MUX('A',28,3) /* PTA_28 */
#define LPUART0_RX_PTA28 KINETIS_MUX('A',28,4) /* PTA_28 */
#define CAN0_RX_PTA28 KINETIS_MUX('A',28,5) /* PTA_28 */
#define PTA29 KINETIS_MUX('A',29,1) /* PTA_29 */
#define FTM5_CH4_PTA29 KINETIS_MUX('A',29,2) /* PTA_29 */
#define LPUART2_TX_PTA29 KINETIS_MUX('A',29,4) /* PTA_29 */
#define LPSPI1_SIN_PTA29 KINETIS_MUX('A',29,5) /* PTA_29 */
#define PTA30 KINETIS_MUX('A',30,1) /* PTA_30 */
#define FTM5_CH5_PTA30 KINETIS_MUX('A',30,2) /* PTA_30 */
#define LPUART2_RX_PTA30 KINETIS_MUX('A',30,3) /* PTA_30 */
#define LPSPI0_SOUT_PTA30 KINETIS_MUX('A',30,4) /* PTA_30 */
#define PTA31 KINETIS_MUX('A',31,1) /* PTA_31 */
#define FTM5_CH6_PTA31 KINETIS_MUX('A',31,2) /* PTA_31 */
#define LPSPI0_PCS1_PTA31 KINETIS_MUX('A',31,4) /* PTA_31 */
#define ADC1_SE14_PTB0 KINETIS_MUX('B',0,0) /* PTB_0 */
#define ADC0_SE4_PTB0 KINETIS_MUX('B',0,0) /* PTB_0 */
#define PTB0 KINETIS_MUX('B',0,1) /* PTB_0 */
#define LPUART0_RX_PTB0 KINETIS_MUX('B',0,2) /* PTB_0 */
#define LPSPI0_PCS0_PTB0 KINETIS_MUX('B',0,3) /* PTB_0 */
#define LPTMR0_ALT3_PTB0 KINETIS_MUX('B',0,4) /* PTB_0 */
#define CAN0_RX_PTB0 KINETIS_MUX('B',0,5) /* PTB_0 */
#define FTM4_CH6_PTB0 KINETIS_MUX('B',0,6) /* PTB_0 */
#define ADC0_SE5_PTB1 KINETIS_MUX('B',1,0) /* PTB_1 */
#define ADC1_SE15_PTB1 KINETIS_MUX('B',1,0) /* PTB_1 */
#define PTB1 KINETIS_MUX('B',1,1) /* PTB_1 */
#define LPUART0_TX_PTB1 KINETIS_MUX('B',1,2) /* PTB_1 */
#define LPSPI0_SOUT_PTB1 KINETIS_MUX('B',1,3) /* PTB_1 */
#define TCLK0_PTB1 KINETIS_MUX('B',1,4) /* PTB_1 */
#define CAN0_TX_PTB1 KINETIS_MUX('B',1,5) /* PTB_1 */
#define FTM4_CH5_PTB1 KINETIS_MUX('B',1,6) /* PTB_1 */
#define ADC0_SE6_PTB2 KINETIS_MUX('B',2,0) /* PTB_2 */
#define PTB2 KINETIS_MUX('B',2,1) /* PTB_2 */
#define FTM1_CH0_PTB2 KINETIS_MUX('B',2,2) /* PTB_2 */
#define LPSPI0_SCK_PTB2 KINETIS_MUX('B',2,3) /* PTB_2 */
#define FTM1_QD_PHB_PTB2 KINETIS_MUX('B',2,4) /* PTB_2 */
#define TRGMUX_IN3_PTB2 KINETIS_MUX('B',2,6) /* PTB_2 */
#define ADC0_SE7_PTB3 KINETIS_MUX('B',3,0) /* PTB_3 */
#define PTB3 KINETIS_MUX('B',3,1) /* PTB_3 */
#define FTM1_CH1_PTB3 KINETIS_MUX('B',3,2) /* PTB_3 */
#define LPSPI0_SIN_PTB3 KINETIS_MUX('B',3,3) /* PTB_3 */
#define FTM1_QD_PHA_PTB3 KINETIS_MUX('B',3,4) /* PTB_3 */
#define TRGMUX_IN2_PTB3 KINETIS_MUX('B',3,6) /* PTB_3 */
#define PTB4 KINETIS_MUX('B',4,1) /* PTB_4 */
#define FTM0_CH4_PTB4 KINETIS_MUX('B',4,2) /* PTB_4 */
#define LPSPI0_SOUT_PTB4 KINETIS_MUX('B',4,3) /* PTB_4 */
#define MII_RMII_MDIO_PTB4 KINETIS_MUX('B',4,5) /* PTB_4 */
#define TRGMUX_IN1_PTB4 KINETIS_MUX('B',4,6) /* PTB_4 */
#define QSPI_B_IO0_PTB4 KINETIS_MUX('B',4,7) /* PTB_4 */
#define PTB5 KINETIS_MUX('B',5,1) /* PTB_5 */
#define FTM0_CH5_PTB5 KINETIS_MUX('B',5,2) /* PTB_5 */
#define LPSPI0_PCS1_PTB5 KINETIS_MUX('B',5,3) /* PTB_5 */
#define LPSPI0_PCS0_PTB5 KINETIS_MUX('B',5,4) /* PTB_5 */
#define CLKOUT_PTB5 KINETIS_MUX('B',5,5) /* PTB_5 */
#define TRGMUX_IN0_PTB5 KINETIS_MUX('B',5,6) /* PTB_5 */
#define MII_RMII_MDC_PTB5 KINETIS_MUX('B',5,7) /* PTB_5 */
#define XTAL_PTB6 KINETIS_MUX('B',6,0) /* PTB_6 */
#define PTB6 KINETIS_MUX('B',6,1) /* PTB_6 */
#define LPI2C0_SDA_PTB6 KINETIS_MUX('B',6,2) /* PTB_6 */
#define EXTAL_PTB7 KINETIS_MUX('B',7,0) /* PTB_7 */
#define PTB7 KINETIS_MUX('B',7,1) /* PTB_7 */
#define LPI2C0_SCL_PTB7 KINETIS_MUX('B',7,2) /* PTB_7 */
#define PTB8 KINETIS_MUX('B',8,1) /* PTB_8 */
#define FTM3_CH0_PTB8 KINETIS_MUX('B',8,2) /* PTB_8 */
#define SAI1_BCLK_PTB8 KINETIS_MUX('B',8,4) /* PTB_8 */
#define PTB9 KINETIS_MUX('B',9,1) /* PTB_9 */
#define FTM3_CH1_PTB9 KINETIS_MUX('B',9,2) /* PTB_9 */
#define LPI2C0_SCLS_PTB9 KINETIS_MUX('B',9,3) /* PTB_9 */
#define SAI1_D0_PTB9 KINETIS_MUX('B',9,4) /* PTB_9 */
#define PTB10 KINETIS_MUX('B',10,1) /* PTB_10 */
#define FTM3_CH2_PTB10 KINETIS_MUX('B',10,2) /* PTB_10 */
#define LPI2C0_SDAS_PTB10 KINETIS_MUX('B',10,3) /* PTB_10 */
#define SAI1_MCLK_PTB10 KINETIS_MUX('B',10,4) /* PTB_10 */
#define PTB11 KINETIS_MUX('B',11,1) /* PTB_11 */
#define FTM3_CH3_PTB11 KINETIS_MUX('B',11,2) /* PTB_11 */
#define LPI2C0_HREQ_PTB11 KINETIS_MUX('B',11,3) /* PTB_11 */
#define ADC1_SE7_PTB12 KINETIS_MUX('B',12,0) /* PTB_12 */
#define PTB12 KINETIS_MUX('B',12,1) /* PTB_12 */
#define FTM0_CH0_PTB12 KINETIS_MUX('B',12,2) /* PTB_12 */
#define FTM3_FLT2_PTB12 KINETIS_MUX('B',12,3) /* PTB_12 */
#define CAN2_RX_PTB12 KINETIS_MUX('B',12,4) /* PTB_12 */
#define FTM6_FLT1_PTB12 KINETIS_MUX('B',12,5) /* PTB_12 */
#define ADC1_SE8_PTB13 KINETIS_MUX('B',13,0) /* PTB_13 */
#define ADC0_SE8_PTB13 KINETIS_MUX('B',13,0) /* PTB_13 */
#define PTB13 KINETIS_MUX('B',13,1) /* PTB_13 */
#define FTM0_CH1_PTB13 KINETIS_MUX('B',13,2) /* PTB_13 */
#define FTM3_FLT1_PTB13 KINETIS_MUX('B',13,3) /* PTB_13 */
#define CAN2_TX_PTB13 KINETIS_MUX('B',13,4) /* PTB_13 */
#define FTM6_FLT0_PTB13 KINETIS_MUX('B',13,5) /* PTB_13 */
#define ADC1_SE9_PTB14 KINETIS_MUX('B',14,0) /* PTB_14 */
#define ADC0_SE9_PTB14 KINETIS_MUX('B',14,0) /* PTB_14 */
#define PTB14 KINETIS_MUX('B',14,1) /* PTB_14 */
#define FTM0_CH2_PTB14 KINETIS_MUX('B',14,2) /* PTB_14 */
#define LPSPI1_SCK_PTB14 KINETIS_MUX('B',14,3) /* PTB_14 */
#define ADC1_SE14_PTB15 KINETIS_MUX('B',15,0) /* PTB_15 */
#define PTB15 KINETIS_MUX('B',15,1) /* PTB_15 */
#define FTM0_CH3_PTB15 KINETIS_MUX('B',15,2) /* PTB_15 */
#define LPSPI1_SIN_PTB15 KINETIS_MUX('B',15,3) /* PTB_15 */
#define ADC1_SE15_PTB16 KINETIS_MUX('B',16,0) /* PTB_16 */
#define PTB16 KINETIS_MUX('B',16,1) /* PTB_16 */
#define FTM0_CH4_PTB16 KINETIS_MUX('B',16,2) /* PTB_16 */
#define LPSPI1_SOUT_PTB16 KINETIS_MUX('B',16,3) /* PTB_16 */
#define PTB17 KINETIS_MUX('B',17,1) /* PTB_17 */
#define FTM0_CH5_PTB17 KINETIS_MUX('B',17,2) /* PTB_17 */
#define LPSPI1_PCS3_PTB17 KINETIS_MUX('B',17,3) /* PTB_17 */
#define FTM5_FLT1_PTB17 KINETIS_MUX('B',17,4) /* PTB_17 */
#define ADC0_SE16_PTB18 KINETIS_MUX('B',18,0) /* PTB_18 */
#define PTB18 KINETIS_MUX('B',18,1) /* PTB_18 */
#define FTM5_CH7_PTB18 KINETIS_MUX('B',18,2) /* PTB_18 */
#define LPSPI1_PCS1_PTB18 KINETIS_MUX('B',18,4) /* PTB_18 */
#define ADC0_SE17_PTB20 KINETIS_MUX('B',20,0) /* PTB_20 */
#define PTB20 KINETIS_MUX('B',20,1) /* PTB_20 */
#define FTM6_CH0_PTB20 KINETIS_MUX('B',20,2) /* PTB_20 */
#define ADC0_SE18_PTB21 KINETIS_MUX('B',21,0) /* PTB_21 */
#define PTB21 KINETIS_MUX('B',21,1) /* PTB_21 */
#define FTM6_CH1_PTB21 KINETIS_MUX('B',21,2) /* PTB_21 */
#define ADC0_SE19_PTB22 KINETIS_MUX('B',22,0) /* PTB_22 */
#define PTB22 KINETIS_MUX('B',22,1) /* PTB_22 */
#define FTM6_CH2_PTB22 KINETIS_MUX('B',22,2) /* PTB_22 */
#define MII_CRS_PTB22 KINETIS_MUX('B',22,3) /* PTB_22 */
#define LPUART1_TX_PTB22 KINETIS_MUX('B',22,5) /* PTB_22 */
#define ADC0_SE20_PTB23 KINETIS_MUX('B',23,0) /* PTB_23 */
#define PTB23 KINETIS_MUX('B',23,1) /* PTB_23 */
#define FTM6_CH3_PTB23 KINETIS_MUX('B',23,2) /* PTB_23 */
#define LPUART1_RX_PTB23 KINETIS_MUX('B',23,3) /* PTB_23 */
#define MII_COL_PTB23 KINETIS_MUX('B',23,4) /* PTB_23 */
#define ADC0_SE21_PTB25 KINETIS_MUX('B',25,0) /* PTB_25 */
#define PTB25 KINETIS_MUX('B',25,1) /* PTB_25 */
#define FTM6_CH5_PTB25 KINETIS_MUX('B',25,2) /* PTB_25 */
#define LPSPI2_PCS0_PTB25 KINETIS_MUX('B',25,5) /* PTB_25 */
#define ADC0_SE22_PTB27 KINETIS_MUX('B',27,0) /* PTB_27 */
#define PTB27 KINETIS_MUX('B',27,1) /* PTB_27 */
#define FTM6_CH7_PTB27 KINETIS_MUX('B',27,2) /* PTB_27 */
#define LPSPI2_SOUT_PTB27 KINETIS_MUX('B',27,5) /* PTB_27 */
#define ADC0_SE23_PTB28 KINETIS_MUX('B',28,0) /* PTB_28 */
#define PTB28 KINETIS_MUX('B',28,1) /* PTB_28 */
#define FTM7_CH0_PTB28 KINETIS_MUX('B',28,2) /* PTB_28 */
#define LPSPI2_SIN_PTB28 KINETIS_MUX('B',28,5) /* PTB_28 */
#define ADC0_SE24_PTB29 KINETIS_MUX('B',29,0) /* PTB_29 */
#define PTB29 KINETIS_MUX('B',29,1) /* PTB_29 */
#define FTM7_CH1_PTB29 KINETIS_MUX('B',29,2) /* PTB_29 */
#define LPSPI2_SCK_PTB29 KINETIS_MUX('B',29,5) /* PTB_29 */
#define ADC0_SE8_PTC0 KINETIS_MUX('C',0,0) /* PTC_0 */
#define PTC0 KINETIS_MUX('C',0,1) /* PTC_0 */
#define FTM0_CH0_PTC0 KINETIS_MUX('C',0,2) /* PTC_0 */
#define LPSPI2_SIN_PTC0 KINETIS_MUX('C',0,3) /* PTC_0 */
#define MII_RMII_RXD1_PTC0 KINETIS_MUX('C',0,4) /* PTC_0 */
#define MII_RMII_RXD0_PTC0 KINETIS_MUX('C',0,5) /* PTC_0 */
#define FTM1_CH6_PTC0 KINETIS_MUX('C',0,6) /* PTC_0 */
#define QSPI_B_RWDS_PTC0 KINETIS_MUX('C',0,7) /* PTC_0 */
#define ADC0_SE9_PTC1 KINETIS_MUX('C',1,0) /* PTC_1 */
#define PTC1 KINETIS_MUX('C',1,1) /* PTC_1 */
#define FTM0_CH1_PTC1 KINETIS_MUX('C',1,2) /* PTC_1 */
#define LPSPI2_SOUT_PTC1 KINETIS_MUX('C',1,3) /* PTC_1 */
#define MII_RMII_RXD1_PTC1 KINETIS_MUX('C',1,4) /* PTC_1 */
#define MII_RMII_RXD0_PTC1 KINETIS_MUX('C',1,5) /* PTC_1 */
#define FTM1_CH7_PTC1 KINETIS_MUX('C',1,6) /* PTC_1 */
#define QSPI_B_SCK_PTC1 KINETIS_MUX('C',1,7) /* PTC_1 */
#define CMP0_IN5_PTC2 KINETIS_MUX('C',2,0) /* PTC_2 */
#define ADC0_SE10_PTC2 KINETIS_MUX('C',2,0) /* PTC_2 */
#define PTC2 KINETIS_MUX('C',2,1) /* PTC_2 */
#define FTM0_CH2_PTC2 KINETIS_MUX('C',2,2) /* PTC_2 */
#define CAN0_RX_PTC2 KINETIS_MUX('C',2,3) /* PTC_2 */
#define LPUART0_RX_PTC2 KINETIS_MUX('C',2,4) /* PTC_2 */
#define MII_RMII_TXD0_PTC2 KINETIS_MUX('C',2,5) /* PTC_2 */
#define ETM_TRACE_CLKOUT_PTC2 KINETIS_MUX('C',2,6) /* PTC_2 */
#define QSPI_A_IO3_PTC2 KINETIS_MUX('C',2,7) /* PTC_2 */
#define CMP0_IN4_PTC3 KINETIS_MUX('C',3,0) /* PTC_3 */
#define ADC0_SE11_PTC3 KINETIS_MUX('C',3,0) /* PTC_3 */
#define PTC3 KINETIS_MUX('C',3,1) /* PTC_3 */
#define FTM0_CH3_PTC3 KINETIS_MUX('C',3,2) /* PTC_3 */
#define CAN0_TX_PTC3 KINETIS_MUX('C',3,3) /* PTC_3 */
#define LPUART0_TX_PTC3 KINETIS_MUX('C',3,4) /* PTC_3 */
#define MII_TX_ER_PTC3 KINETIS_MUX('C',3,5) /* PTC_3 */
#define QSPI_A_CS_PTC3 KINETIS_MUX('C',3,6) /* PTC_3 */
#define QSPI_B_IO3_PTC3 KINETIS_MUX('C',3,7) /* PTC_3 */
#define CMP0_IN2_PTC4 KINETIS_MUX('C',4,0) /* PTC_4 */
#define PTC4 KINETIS_MUX('C',4,1) /* PTC_4 */
#define FTM1_CH0_PTC4 KINETIS_MUX('C',4,2) /* PTC_4 */
#define RTC_CLKOUT_PTC4 KINETIS_MUX('C',4,3) /* PTC_4 */
#define EWM_IN_PTC4 KINETIS_MUX('C',4,5) /* PTC_4 */
#define FTM1_QD_PHB_PTC4 KINETIS_MUX('C',4,6) /* PTC_4 */
#define JTAG_TCLK_SWD_CLK_PTC4 KINETIS_MUX('C',4,7) /* PTC_4 */
#define PTC5 KINETIS_MUX('C',5,1) /* PTC_5 */
#define FTM2_CH0_PTC5 KINETIS_MUX('C',5,2) /* PTC_5 */
#define RTC_CLKOUT_PTC5 KINETIS_MUX('C',5,3) /* PTC_5 */
#define LPI2C1_HREQ_PTC5 KINETIS_MUX('C',5,4) /* PTC_5 */
#define FTM2_QD_PHB_PTC5 KINETIS_MUX('C',5,6) /* PTC_5 */
#define JTAG_TDI_PTC5 KINETIS_MUX('C',5,7) /* PTC_5 */
#define ADC1_SE4_PTC6 KINETIS_MUX('C',6,0) /* PTC_6 */
#define PTC6 KINETIS_MUX('C',6,1) /* PTC_6 */
#define LPUART1_RX_PTC6 KINETIS_MUX('C',6,2) /* PTC_6 */
#define CAN1_RX_PTC6 KINETIS_MUX('C',6,3) /* PTC_6 */
#define FTM3_CH2_PTC6 KINETIS_MUX('C',6,4) /* PTC_6 */
#define FTM1_QD_PHB_PTC6 KINETIS_MUX('C',6,6) /* PTC_6 */
#define ADC1_SE5_PTC7 KINETIS_MUX('C',7,0) /* PTC_7 */
#define PTC7 KINETIS_MUX('C',7,1) /* PTC_7 */
#define LPUART1_TX_PTC7 KINETIS_MUX('C',7,2) /* PTC_7 */
#define CAN1_TX_PTC7 KINETIS_MUX('C',7,3) /* PTC_7 */
#define FTM3_CH3_PTC7 KINETIS_MUX('C',7,4) /* PTC_7 */
#define FTM1_QD_PHA_PTC7 KINETIS_MUX('C',7,6) /* PTC_7 */
#define PTC8 KINETIS_MUX('C',8,1) /* PTC_8 */
#define LPUART1_RX_PTC8 KINETIS_MUX('C',8,2) /* PTC_8 */
#define FTM1_FLT0_PTC8 KINETIS_MUX('C',8,3) /* PTC_8 */
#define FTM5_CH1_PTC8 KINETIS_MUX('C',8,4) /* PTC_8 */
#define LPUART0_CTS_PTC8 KINETIS_MUX('C',8,6) /* PTC_8 */
#define PTC9 KINETIS_MUX('C',9,1) /* PTC_9 */
#define LPUART1_TX_PTC9 KINETIS_MUX('C',9,2) /* PTC_9 */
#define FTM1_FLT1_PTC9 KINETIS_MUX('C',9,3) /* PTC_9 */
#define FTM5_CH0_PTC9 KINETIS_MUX('C',9,4) /* PTC_9 */
#define LPUART0_RTS_PTC9 KINETIS_MUX('C',9,6) /* PTC_9 */
#define PTC10 KINETIS_MUX('C',10,1) /* PTC_10 */
#define FTM3_CH4_PTC10 KINETIS_MUX('C',10,2) /* PTC_10 */
#define TRGMUX_IN11_PTC10 KINETIS_MUX('C',10,6) /* PTC_10 */
#define PTC11 KINETIS_MUX('C',11,1) /* PTC_11 */
#define FTM3_CH5_PTC11 KINETIS_MUX('C',11,2) /* PTC_11 */
#define FTM4_CH2_PTC11 KINETIS_MUX('C',11,3) /* PTC_11 */
#define TRGMUX_IN10_PTC11 KINETIS_MUX('C',11,6) /* PTC_11 */
#define PTC12 KINETIS_MUX('C',12,1) /* PTC_12 */
#define FTM3_CH6_PTC12 KINETIS_MUX('C',12,2) /* PTC_12 */
#define FTM2_CH6_PTC12 KINETIS_MUX('C',12,3) /* PTC_12 */
#define LPUART2_CTS_PTC12 KINETIS_MUX('C',12,4) /* PTC_12 */
#define PTC13 KINETIS_MUX('C',13,1) /* PTC_13 */
#define FTM3_CH7_PTC13 KINETIS_MUX('C',13,2) /* PTC_13 */
#define FTM2_CH7_PTC13 KINETIS_MUX('C',13,3) /* PTC_13 */
#define LPUART2_RTS_PTC13 KINETIS_MUX('C',13,4) /* PTC_13 */
#define ADC0_SE12_PTC14 KINETIS_MUX('C',14,0) /* PTC_14 */
#define PTC14 KINETIS_MUX('C',14,1) /* PTC_14 */
#define FTM1_CH2_PTC14 KINETIS_MUX('C',14,2) /* PTC_14 */
#define LPSPI2_PCS0_PTC14 KINETIS_MUX('C',14,3) /* PTC_14 */
#define MII_COL_PTC14 KINETIS_MUX('C',14,4) /* PTC_14 */
#define TRGMUX_IN9_PTC14 KINETIS_MUX('C',14,6) /* PTC_14 */
#define ADC0_SE13_PTC15 KINETIS_MUX('C',15,0) /* PTC_15 */
#define PTC15 KINETIS_MUX('C',15,1) /* PTC_15 */
#define FTM1_CH3_PTC15 KINETIS_MUX('C',15,2) /* PTC_15 */
#define LPSPI2_SCK_PTC15 KINETIS_MUX('C',15,3) /* PTC_15 */
#define MII_CRS_PTC15 KINETIS_MUX('C',15,4) /* PTC_15 */
#define TRGMUX_IN8_PTC15 KINETIS_MUX('C',15,6) /* PTC_15 */
#define QSPI_B_CS_PTC15 KINETIS_MUX('C',15,7) /* PTC_15 */
#define ADC0_SE14_PTC16 KINETIS_MUX('C',16,0) /* PTC_16 */
#define PTC16 KINETIS_MUX('C',16,1) /* PTC_16 */
#define FTM1_FLT2_PTC16 KINETIS_MUX('C',16,2) /* PTC_16 */
#define CAN2_RX_PTC16 KINETIS_MUX('C',16,3) /* PTC_16 */
#define LPI2C1_SDAS_PTC16 KINETIS_MUX('C',16,4) /* PTC_16 */
#define MII_RMII_RX_ER_PTC16 KINETIS_MUX('C',16,5) /* PTC_16 */
#define ADC0_SE15_PTC17 KINETIS_MUX('C',17,0) /* PTC_17 */
#define PTC17 KINETIS_MUX('C',17,1) /* PTC_17 */
#define FTM1_FLT3_PTC17 KINETIS_MUX('C',17,2) /* PTC_17 */
#define CAN2_TX_PTC17 KINETIS_MUX('C',17,3) /* PTC_17 */
#define LPI2C1_SCLS_PTC17 KINETIS_MUX('C',17,4) /* PTC_17 */
#define MII_RMII_RX_DV_PTC17 KINETIS_MUX('C',17,5) /* PTC_17 */
#define ADC0_SE25_PTC19 KINETIS_MUX('C',19,0) /* PTC_19 */
#define PTC19 KINETIS_MUX('C',19,1) /* PTC_19 */
#define FTM7_CH5_PTC19 KINETIS_MUX('C',19,2) /* PTC_19 */
#define LPSPI2_PCS1_PTC19 KINETIS_MUX('C',19,5) /* PTC_19 */
#define ADC0_SE26_PTC23 KINETIS_MUX('C',23,0) /* PTC_23 */
#define PTC23 KINETIS_MUX('C',23,1) /* PTC_23 */
#define LPSPI0_SCK_PTC23 KINETIS_MUX('C',23,2) /* PTC_23 */
#define ADC0_SE27_PTC27 KINETIS_MUX('C',27,0) /* PTC_27 */
#define PTC27 KINETIS_MUX('C',27,1) /* PTC_27 */
#define FTM4_CH4_PTC27 KINETIS_MUX('C',27,2) /* PTC_27 */
#define ADC0_SE28_PTC28 KINETIS_MUX('C',28,0) /* PTC_28 */
#define PTC28 KINETIS_MUX('C',28,1) /* PTC_28 */
#define FTM4_CH7_PTC28 KINETIS_MUX('C',28,2) /* PTC_28 */
#define ADC0_SE29_PTC29 KINETIS_MUX('C',29,0) /* PTC_29 */
#define PTC29 KINETIS_MUX('C',29,1) /* PTC_29 */
#define FTM5_CH2_PTC29 KINETIS_MUX('C',29,2) /* PTC_29 */
#define ADC0_SE30_PTC30 KINETIS_MUX('C',30,0) /* PTC_30 */
#define PTC30 KINETIS_MUX('C',30,1) /* PTC_30 */
#define FTM5_CH4_PTC30 KINETIS_MUX('C',30,2) /* PTC_30 */
#define FXIO_D0_PTC30 KINETIS_MUX('C',30,3) /* PTC_30 */
#define LPI2C1_SDAS_PTC30 KINETIS_MUX('C',30,4) /* PTC_30 */
#define ADC0_SE31_PTC31 KINETIS_MUX('C',31,0) /* PTC_31 */
#define PTC31 KINETIS_MUX('C',31,1) /* PTC_31 */
#define FTM5_CH6_PTC31 KINETIS_MUX('C',31,2) /* PTC_31 */
#define FXIO_D1_PTC31 KINETIS_MUX('C',31,3) /* PTC_31 */
#define LPI2C1_SDA_PTC31 KINETIS_MUX('C',31,4) /* PTC_31 */
#define PTD0 KINETIS_MUX('D',0,1) /* PTD_0 */
#define FTM0_CH2_PTD0 KINETIS_MUX('D',0,2) /* PTD_0 */
#define LPSPI1_SCK_PTD0 KINETIS_MUX('D',0,3) /* PTD_0 */
#define FTM2_CH0_PTD0 KINETIS_MUX('D',0,4) /* PTD_0 */
#define ETM_TRACE_D0_PTD0 KINETIS_MUX('D',0,5) /* PTD_0 */
#define FXIO_D0_PTD0 KINETIS_MUX('D',0,6) /* PTD_0 */
#define TRGMUX_OUT1_PTD0 KINETIS_MUX('D',0,7) /* PTD_0 */
#define PTD1 KINETIS_MUX('D',1,1) /* PTD_1 */
#define FTM0_CH3_PTD1 KINETIS_MUX('D',1,2) /* PTD_1 */
#define LPSPI1_SIN_PTD1 KINETIS_MUX('D',1,3) /* PTD_1 */
#define FTM2_CH1_PTD1 KINETIS_MUX('D',1,4) /* PTD_1 */
#define SAI0_MCLK_PTD1 KINETIS_MUX('D',1,5) /* PTD_1 */
#define FXIO_D1_PTD1 KINETIS_MUX('D',1,6) /* PTD_1 */
#define TRGMUX_OUT2_PTD1 KINETIS_MUX('D',1,7) /* PTD_1 */
#define ADC1_SE2_PTD2 KINETIS_MUX('D',2,0) /* PTD_2 */
#define PTD2 KINETIS_MUX('D',2,1) /* PTD_2 */
#define FTM3_CH4_PTD2 KINETIS_MUX('D',2,2) /* PTD_2 */
#define LPSPI1_SOUT_PTD2 KINETIS_MUX('D',2,3) /* PTD_2 */
#define FXIO_D4_PTD2 KINETIS_MUX('D',2,4) /* PTD_2 */
#define FXIO_D6_PTD2 KINETIS_MUX('D',2,5) /* PTD_2 */
#define TRGMUX_IN5_PTD2 KINETIS_MUX('D',2,6) /* PTD_2 */
#define ADC1_SE3_PTD3 KINETIS_MUX('D',3,0) /* PTD_3 */
#define PTD3 KINETIS_MUX('D',3,1) /* PTD_3 */
#define FTM3_CH5_PTD3 KINETIS_MUX('D',3,2) /* PTD_3 */
#define LPSPI1_PCS0_PTD3 KINETIS_MUX('D',3,3) /* PTD_3 */
#define FXIO_D5_PTD3 KINETIS_MUX('D',3,4) /* PTD_3 */
#define FXIO_D7_PTD3 KINETIS_MUX('D',3,5) /* PTD_3 */
#define TRGMUX_IN4_PTD3 KINETIS_MUX('D',3,6) /* PTD_3 */
#define NMI_b_PTD3 KINETIS_MUX('D',3,7) /* PTD_3 */
