zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXE247VLQ-pinctrl.h
#define ADC1_SE6_PTD4 KINETIS_MUX('D',4,0) /* PTD_4 */
#define PTD4 KINETIS_MUX('D',4,1) /* PTD_4 */
#define FTM0_FLT3_PTD4 KINETIS_MUX('D',4,2) /* PTD_4 */
#define FTM3_FLT3_PTD4 KINETIS_MUX('D',4,3) /* PTD_4 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD_5 */
#define FTM2_CH3_PTD5 KINETIS_MUX('D',5,2) /* PTD_5 */
#define LPTMR0_ALT2_PTD5 KINETIS_MUX('D',5,3) /* PTD_5 */
#define FTM2_FLT1_PTD5 KINETIS_MUX('D',5,4) /* PTD_5 */
#define MII_TXD3_PTD5 KINETIS_MUX('D',5,5) /* PTD_5 */
#define TRGMUX_IN7_PTD5 KINETIS_MUX('D',5,6) /* PTD_5 */
#define QSPI_B_IO2_PTD5 KINETIS_MUX('D',5,7) /* PTD_5 */
#define CMP0_IN7_PTD6 KINETIS_MUX('D',6,0) /* PTD_6 */
#define PTD6 KINETIS_MUX('D',6,1) /* PTD_6 */
#define LPUART2_RX_PTD6 KINETIS_MUX('D',6,2) /* PTD_6 */
#define FTM2_FLT2_PTD6 KINETIS_MUX('D',6,4) /* PTD_6 */
#define MII_TXD2_PTD6 KINETIS_MUX('D',6,5) /* PTD_6 */
#define QSPI_B_IO1_PTD6 KINETIS_MUX('D',6,7) /* PTD_6 */
#define CMP0_IN6_PTD7 KINETIS_MUX('D',7,0) /* PTD_7 */
#define PTD7 KINETIS_MUX('D',7,1) /* PTD_7 */
#define LPUART2_TX_PTD7 KINETIS_MUX('D',7,2) /* PTD_7 */
#define FTM2_FLT3_PTD7 KINETIS_MUX('D',7,4) /* PTD_7 */
#define MII_RMII_TXD1_PTD7 KINETIS_MUX('D',7,5) /* PTD_7 */
#define ETM_TRACE_D0_PTD7 KINETIS_MUX('D',7,6) /* PTD_7 */
#define QSPI_A_IO1_PTD7 KINETIS_MUX('D',7,7) /* PTD_7 */
#define PTD8 KINETIS_MUX('D',8,1) /* PTD_8 */
#define LPI2C1_SDA_PTD8 KINETIS_MUX('D',8,2) /* PTD_8 */
#define MII_RXD3_PTD8 KINETIS_MUX('D',8,3) /* PTD_8 */
#define FTM2_FLT2_PTD8 KINETIS_MUX('D',8,4) /* PTD_8 */
#define FXIO_D1_PTD8 KINETIS_MUX('D',8,5) /* PTD_8 */
#define FTM1_CH4_PTD8 KINETIS_MUX('D',8,6) /* PTD_8 */
#define PTD9 KINETIS_MUX('D',9,1) /* PTD_9 */
#define LPI2C1_SCL_PTD9 KINETIS_MUX('D',9,2) /* PTD_9 */
#define FXIO_D0_PTD9 KINETIS_MUX('D',9,3) /* PTD_9 */
#define FTM2_FLT3_PTD9 KINETIS_MUX('D',9,4) /* PTD_9 */
#define MII_RXD2_PTD9 KINETIS_MUX('D',9,5) /* PTD_9 */
#define FTM1_CH5_PTD9 KINETIS_MUX('D',9,6) /* PTD_9 */
#define PTD10 KINETIS_MUX('D',10,1) /* PTD_10 */
#define FTM2_CH0_PTD10 KINETIS_MUX('D',10,2) /* PTD_10 */
#define FTM2_QD_PHB_PTD10 KINETIS_MUX('D',10,3) /* PTD_10 */
#define ETM_TRACE_D3_PTD10 KINETIS_MUX('D',10,4) /* PTD_10 */
#define MII_RX_CLK_PTD10 KINETIS_MUX('D',10,5) /* PTD_10 */
#define CLKOUT_PTD10 KINETIS_MUX('D',10,6) /* PTD_10 */
#define QSPI_A_SCK_PTD10 KINETIS_MUX('D',10,7) /* PTD_10 */
#define PTD11 KINETIS_MUX('D',11,1) /* PTD_11 */
#define FTM2_CH1_PTD11 KINETIS_MUX('D',11,2) /* PTD_11 */
#define FTM2_QD_PHA_PTD11 KINETIS_MUX('D',11,3) /* PTD_11 */
#define ETM_TRACE_D2_PTD11 KINETIS_MUX('D',11,4) /* PTD_11 */
#define MII_RMII_TX_CLK_PTD11 KINETIS_MUX('D',11,5) /* PTD_11 */
#define LPUART2_CTS_PTD11 KINETIS_MUX('D',11,6) /* PTD_11 */
#define QSPI_A_IO0_PTD11 KINETIS_MUX('D',11,7) /* PTD_11 */
#define PTD12 KINETIS_MUX('D',12,1) /* PTD_12 */
#define FTM2_CH2_PTD12 KINETIS_MUX('D',12,2) /* PTD_12 */
#define LPI2C1_HREQ_PTD12 KINETIS_MUX('D',12,3) /* PTD_12 */
#define ETM_TRACE_D1_PTD12 KINETIS_MUX('D',12,4) /* PTD_12 */
#define MII_RMII_TX_EN_PTD12 KINETIS_MUX('D',12,5) /* PTD_12 */
#define LPUART2_RTS_PTD12 KINETIS_MUX('D',12,6) /* PTD_12 */
#define QSPI_A_IO2_PTD12 KINETIS_MUX('D',12,7) /* PTD_12 */
#define PTD13 KINETIS_MUX('D',13,1) /* PTD_13 */
#define FTM2_CH4_PTD13 KINETIS_MUX('D',13,2) /* PTD_13 */
#define LPUART1_RX_PTD13 KINETIS_MUX('D',13,3) /* PTD_13 */
#define ENET_TMR1_PTD13 KINETIS_MUX('D',13,5) /* PTD_13 */
#define RTC_CLKOUT_PTD13 KINETIS_MUX('D',13,7) /* PTD_13 */
#define PTD14 KINETIS_MUX('D',14,1) /* PTD_14 */
#define FTM2_CH5_PTD14 KINETIS_MUX('D',14,2) /* PTD_14 */
#define LPUART1_TX_PTD14 KINETIS_MUX('D',14,3) /* PTD_14 */
#define ENET_TMR0_PTD14 KINETIS_MUX('D',14,5) /* PTD_14 */
#define CLKOUT_PTD14 KINETIS_MUX('D',14,7) /* PTD_14 */
#define PTD15 KINETIS_MUX('D',15,1) /* PTD_15 */
#define FTM0_CH0_PTD15 KINETIS_MUX('D',15,2) /* PTD_15 */
#define ETM_TRACE_D3_PTD15 KINETIS_MUX('D',15,3) /* PTD_15 */
#define LPSPI0_SCK_PTD15 KINETIS_MUX('D',15,4) /* PTD_15 */
#define ENET_TMR2_PTD15 KINETIS_MUX('D',15,5) /* PTD_15 */
#define PTD16 KINETIS_MUX('D',16,1) /* PTD_16 */
#define FTM0_CH1_PTD16 KINETIS_MUX('D',16,2) /* PTD_16 */
#define ETM_TRACE_D2_PTD16 KINETIS_MUX('D',16,3) /* PTD_16 */
#define LPSPI0_SIN_PTD16 KINETIS_MUX('D',16,4) /* PTD_16 */
#define CMP0_RRT_PTD16 KINETIS_MUX('D',16,5) /* PTD_16 */
#define ETM_TRACE_CLKOUT_PTD16 KINETIS_MUX('D',16,6) /* PTD_16 */
#define PTD17 KINETIS_MUX('D',17,1) /* PTD_17 */
#define FTM0_FLT2_PTD17 KINETIS_MUX('D',17,2) /* PTD_17 */
#define LPUART2_RX_PTD17 KINETIS_MUX('D',17,3) /* PTD_17 */
#define FTM5_FLT1_PTD17 KINETIS_MUX('D',17,4) /* PTD_17 */
#define ADC1_SE16_PTD18 KINETIS_MUX('D',18,0) /* PTD_18 */
#define PTD18 KINETIS_MUX('D',18,1) /* PTD_18 */
#define FTM5_CH7_PTD18 KINETIS_MUX('D',18,2) /* PTD_18 */
#define FXIO_D2_PTD18 KINETIS_MUX('D',18,3) /* PTD_18 */
#define LPI2C1_SCLS_PTD18 KINETIS_MUX('D',18,4) /* PTD_18 */
#define ADC1_SE17_PTD19 KINETIS_MUX('D',19,0) /* PTD_19 */
#define PTD19 KINETIS_MUX('D',19,1) /* PTD_19 */
#define FTM6_CH0_PTD19 KINETIS_MUX('D',19,2) /* PTD_19 */
#define FXIO_D3_PTD19 KINETIS_MUX('D',19,3) /* PTD_19 */
#define LPI2C1_SCL_PTD19 KINETIS_MUX('D',19,4) /* PTD_19 */
#define ADC1_SE18_PTD22 KINETIS_MUX('D',22,0) /* PTD_22 */
#define PTD22 KINETIS_MUX('D',22,1) /* PTD_22 */
#define FTM6_CH3_PTD22 KINETIS_MUX('D',22,2) /* PTD_22 */
#define ADC1_SE19_PTD23 KINETIS_MUX('D',23,0) /* PTD_23 */
#define PTD23 KINETIS_MUX('D',23,1) /* PTD_23 */
#define FTM6_CH4_PTD23 KINETIS_MUX('D',23,2) /* PTD_23 */
#define ADC1_SE20_PTD24 KINETIS_MUX('D',24,0) /* PTD_24 */
#define PTD24 KINETIS_MUX('D',24,1) /* PTD_24 */
#define FTM6_CH5_PTD24 KINETIS_MUX('D',24,2) /* PTD_24 */
#define ADC1_SE21_PTD27 KINETIS_MUX('D',27,0) /* PTD_27 */
#define PTD27 KINETIS_MUX('D',27,1) /* PTD_27 */
#define FTM7_CH0_PTD27 KINETIS_MUX('D',27,2) /* PTD_27 */
#define ADC1_SE22_PTD28 KINETIS_MUX('D',28,0) /* PTD_28 */
#define PTD28 KINETIS_MUX('D',28,1) /* PTD_28 */
#define FTM7_CH1_PTD28 KINETIS_MUX('D',28,2) /* PTD_28 */
#define ADC1_SE23_PTD29 KINETIS_MUX('D',29,0) /* PTD_29 */
#define PTD29 KINETIS_MUX('D',29,1) /* PTD_29 */
#define FTM7_CH2_PTD29 KINETIS_MUX('D',29,2) /* PTD_29 */
#define ADC1_SE24_PTD30 KINETIS_MUX('D',30,0) /* PTD_30 */
#define PTD30 KINETIS_MUX('D',30,1) /* PTD_30 */
#define FTM7_CH3_PTD30 KINETIS_MUX('D',30,2) /* PTD_30 */
#define FTM6_FLT1_PTD30 KINETIS_MUX('D',30,3) /* PTD_30 */
#define PTE0 KINETIS_MUX('E',0,1) /* PTE_0 */
#define LPSPI0_SCK_PTE0 KINETIS_MUX('E',0,2) /* PTE_0 */
#define TCLK1_PTE0 KINETIS_MUX('E',0,3) /* PTE_0 */
#define LPI2C1_SDA_PTE0 KINETIS_MUX('E',0,4) /* PTE_0 */
#define LPSPI1_SOUT_PTE0 KINETIS_MUX('E',0,5) /* PTE_0 */
#define FTM1_FLT2_PTE0 KINETIS_MUX('E',0,6) /* PTE_0 */
#define SAI0_D2_PTE0 KINETIS_MUX('E',0,7) /* PTE_0 */
#define PTE1 KINETIS_MUX('E',1,1) /* PTE_1 */
#define LPSPI0_SIN_PTE1 KINETIS_MUX('E',1,2) /* PTE_1 */
#define LPI2C0_HREQ_PTE1 KINETIS_MUX('E',1,3) /* PTE_1 */
#define LPI2C1_SCL_PTE1 KINETIS_MUX('E',1,4) /* PTE_1 */
#define LPSPI1_PCS0_PTE1 KINETIS_MUX('E',1,5) /* PTE_1 */
#define FTM1_FLT1_PTE1 KINETIS_MUX('E',1,6) /* PTE_1 */
#define SAI0_D1_PTE1 KINETIS_MUX('E',1,7) /* PTE_1 */
#define ADC1_SE10_PTE2 KINETIS_MUX('E',2,0) /* PTE_2 */
#define PTE2 KINETIS_MUX('E',2,1) /* PTE_2 */
#define LPSPI0_SOUT_PTE2 KINETIS_MUX('E',2,2) /* PTE_2 */
#define LPTMR0_ALT3_PTE2 KINETIS_MUX('E',2,3) /* PTE_2 */
#define FTM3_CH6_PTE2 KINETIS_MUX('E',2,4) /* PTE_2 */
#define LPUART1_CTS_PTE2 KINETIS_MUX('E',2,6) /* PTE_2 */
#define SAI1_SYNC_PTE2 KINETIS_MUX('E',2,7) /* PTE_2 */
#define PTE3 KINETIS_MUX('E',3,1) /* PTE_3 */
#define FTM0_FLT0_PTE3 KINETIS_MUX('E',3,2) /* PTE_3 */
#define LPUART2_RTS_PTE3 KINETIS_MUX('E',3,3) /* PTE_3 */
#define FTM2_FLT0_PTE3 KINETIS_MUX('E',3,4) /* PTE_3 */
#define TRGMUX_IN6_PTE3 KINETIS_MUX('E',3,6) /* PTE_3 */
#define CMP0_OUT_PTE3 KINETIS_MUX('E',3,7) /* PTE_3 */
#define PTE4 KINETIS_MUX('E',4,1) /* PTE_4 */
#define ETM_TRACE_D1_PTE4 KINETIS_MUX('E',4,2) /* PTE_4 */
#define FTM2_QD_PHB_PTE4 KINETIS_MUX('E',4,3) /* PTE_4 */
#define FTM2_CH2_PTE4 KINETIS_MUX('E',4,4) /* PTE_4 */
#define CAN0_RX_PTE4 KINETIS_MUX('E',4,5) /* PTE_4 */
#define FXIO_D6_PTE4 KINETIS_MUX('E',4,6) /* PTE_4 */
#define EWM_OUT_b_PTE4 KINETIS_MUX('E',4,7) /* PTE_4 */
#define PTE5 KINETIS_MUX('E',5,1) /* PTE_5 */
#define TCLK2_PTE5 KINETIS_MUX('E',5,2) /* PTE_5 */
#define FTM2_QD_PHA_PTE5 KINETIS_MUX('E',5,3) /* PTE_5 */
#define FTM2_CH3_PTE5 KINETIS_MUX('E',5,4) /* PTE_5 */
#define CAN0_TX_PTE5 KINETIS_MUX('E',5,5) /* PTE_5 */
#define FXIO_D7_PTE5 KINETIS_MUX('E',5,6) /* PTE_5 */
#define EWM_IN_PTE5 KINETIS_MUX('E',5,7) /* PTE_5 */
#define ADC1_SE11_PTE6 KINETIS_MUX('E',6,0) /* PTE_6 */
#define PTE6 KINETIS_MUX('E',6,1) /* PTE_6 */
#define LPSPI0_PCS2_PTE6 KINETIS_MUX('E',6,2) /* PTE_6 */
#define FTM7_FLT1_PTE6 KINETIS_MUX('E',6,3) /* PTE_6 */
#define FTM3_CH7_PTE6 KINETIS_MUX('E',6,4) /* PTE_6 */
#define LPUART1_RTS_PTE6 KINETIS_MUX('E',6,6) /* PTE_6 */
#define PTE7 KINETIS_MUX('E',7,1) /* PTE_7 */
#define FTM0_CH7_PTE7 KINETIS_MUX('E',7,2) /* PTE_7 */
#define FTM3_FLT0_PTE7 KINETIS_MUX('E',7,3) /* PTE_7 */
#define CMP0_IN3_PTE8 KINETIS_MUX('E',8,0) /* PTE_8 */
#define PTE8 KINETIS_MUX('E',8,1) /* PTE_8 */
#define FTM0_CH6_PTE8 KINETIS_MUX('E',8,2) /* PTE_8 */
#define MII_RMII_MDC_PTE8 KINETIS_MUX('E',8,5) /* PTE_8 */
#define PTE9 KINETIS_MUX('E',9,1) /* PTE_9 */
#define FTM0_CH7_PTE9 KINETIS_MUX('E',9,2) /* PTE_9 */
#define LPUART2_CTS_PTE9 KINETIS_MUX('E',9,3) /* PTE_9 */
#define ENET_TMR3_PTE9 KINETIS_MUX('E',9,5) /* PTE_9 */
#define PTE10 KINETIS_MUX('E',10,1) /* PTE_10 */
#define CLKOUT_PTE10 KINETIS_MUX('E',10,2) /* PTE_10 */
#define LPSPI2_PCS1_PTE10 KINETIS_MUX('E',10,3) /* PTE_10 */
#define FTM2_CH4_PTE10 KINETIS_MUX('E',10,4) /* PTE_10 */
#define FXIO_D4_PTE10 KINETIS_MUX('E',10,6) /* PTE_10 */
#define TRGMUX_OUT4_PTE10 KINETIS_MUX('E',10,7) /* PTE_10 */
#define PTE11 KINETIS_MUX('E',11,1) /* PTE_11 */
#define LPSPI2_PCS0_PTE11 KINETIS_MUX('E',11,2) /* PTE_11 */
#define LPTMR0_ALT1_PTE11 KINETIS_MUX('E',11,3) /* PTE_11 */
#define FTM2_CH5_PTE11 KINETIS_MUX('E',11,4) /* PTE_11 */
#define FXIO_D5_PTE11 KINETIS_MUX('E',11,6) /* PTE_11 */
#define TRGMUX_OUT5_PTE11 KINETIS_MUX('E',11,7) /* PTE_11 */
#define PTE12 KINETIS_MUX('E',12,1) /* PTE_12 */
#define FTM0_FLT3_PTE12 KINETIS_MUX('E',12,2) /* PTE_12 */
#define LPUART2_TX_PTE12 KINETIS_MUX('E',12,3) /* PTE_12 */
#define FTM5_FLT0_PTE12 KINETIS_MUX('E',12,4) /* PTE_12 */
#define PTE13 KINETIS_MUX('E',13,1) /* PTE_13 */
#define FTM4_CH5_PTE13 KINETIS_MUX('E',13,2) /* PTE_13 */
#define LPSPI2_PCS2_PTE13 KINETIS_MUX('E',13,3) /* PTE_13 */
#define FTM2_FLT0_PTE13 KINETIS_MUX('E',13,4) /* PTE_13 */
#define PTE14 KINETIS_MUX('E',14,1) /* PTE_14 */
#define FTM0_FLT1_PTE14 KINETIS_MUX('E',14,2) /* PTE_14 */
#define FTM2_FLT1_PTE14 KINETIS_MUX('E',14,4) /* PTE_14 */
#define PTE15 KINETIS_MUX('E',15,1) /* PTE_15 */
#define LPUART1_CTS_PTE15 KINETIS_MUX('E',15,2) /* PTE_15 */
#define LPSPI2_SCK_PTE15 KINETIS_MUX('E',15,3) /* PTE_15 */
#define FTM2_CH6_PTE15 KINETIS_MUX('E',15,4) /* PTE_15 */
#define FTM4_FLT1_PTE15 KINETIS_MUX('E',15,5) /* PTE_15 */
#define FXIO_D2_PTE15 KINETIS_MUX('E',15,6) /* PTE_15 */
#define TRGMUX_OUT6_PTE15 KINETIS_MUX('E',15,7) /* PTE_15 */
#define PTE16 KINETIS_MUX('E',16,1) /* PTE_16 */
#define LPUART1_RTS_PTE16 KINETIS_MUX('E',16,2) /* PTE_16 */
#define LPSPI2_SIN_PTE16 KINETIS_MUX('E',16,3) /* PTE_16 */
#define FTM2_CH7_PTE16 KINETIS_MUX('E',16,4) /* PTE_16 */
#define FTM4_FLT0_PTE16 KINETIS_MUX('E',16,5) /* PTE_16 */
#define FXIO_D3_PTE16 KINETIS_MUX('E',16,6) /* PTE_16 */
#define TRGMUX_OUT7_PTE16 KINETIS_MUX('E',16,7) /* PTE_16 */
#define ADC1_SE25_PTE19 KINETIS_MUX('E',19,0) /* PTE_19 */
#define PTE19 KINETIS_MUX('E',19,1) /* PTE_19 */
#define FTM7_CH7_PTE19 KINETIS_MUX('E',19,2) /* PTE_19 */
#define ADC1_SE26_PTE20 KINETIS_MUX('E',20,0) /* PTE_20 */
#define PTE20 KINETIS_MUX('E',20,1) /* PTE_20 */
#define FTM4_CH0_PTE20 KINETIS_MUX('E',20,2) /* PTE_20 */
#define ADC1_SE27_PTE21 KINETIS_MUX('E',21,0) /* PTE_21 */
#define PTE21 KINETIS_MUX('E',21,1) /* PTE_21 */
#define FTM4_CH1_PTE21 KINETIS_MUX('E',21,2) /* PTE_21 */
#define ADC1_SE28_PTE22 KINETIS_MUX('E',22,0) /* PTE_22 */
#define PTE22 KINETIS_MUX('E',22,1) /* PTE_22 */
#define FTM4_CH2_PTE22 KINETIS_MUX('E',22,2) /* PTE_22 */
#define ADC1_SE29_PTE23 KINETIS_MUX('E',23,0) /* PTE_23 */
#define PTE23 KINETIS_MUX('E',23,1) /* PTE_23 */
#define FTM4_CH3_PTE23 KINETIS_MUX('E',23,2) /* PTE_23 */
#define ADC1_SE30_PTE24 KINETIS_MUX('E',24,0) /* PTE_24 */
#define PTE24 KINETIS_MUX('E',24,1) /* PTE_24 */
#define FTM4_CH4_PTE24 KINETIS_MUX('E',24,2) /* PTE_24 */
#define CAN2_TX_PTE24 KINETIS_MUX('E',24,3) /* PTE_24 */
#define ADC1_SE31_PTE25 KINETIS_MUX('E',25,0) /* PTE_25 */
#define PTE25 KINETIS_MUX('E',25,1) /* PTE_25 */
#define FTM4_CH5_PTE25 KINETIS_MUX('E',25,2) /* PTE_25 */
#define CAN2_RX_PTE25 KINETIS_MUX('E',25,3) /* PTE_25 */
#endif
